app/controllers/api/feeds_controller.rb

    def show
        @feed = Feed.find(params[:id])
---
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]